---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.PathDoesntJoinToBorderRisersFailure
source: html/4794153c-fccf-bee2-ba59-fb6078cbda91.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.PathDoesntJoinToBorderRisersFailure Property

Path doesn't join to border risers is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathDoesntJoinToBorderRisersFailure { get; }
```